"""
Условные конструкции

Напишите программу, которая принимает возраст пользователя и выводит, 
является ли он ребенком, подростком, взрослым или пожилым человеком в зависимости от возраста.

Напишите функцию categorize_age(age), которая принимает возраст пользователя в виде целого числа и возвращает строку, 
описывающую возрастную категорию пользователя. Возрастные категории определяются следующим образом:
- 0-12: возвращает "Ребенок"
- 13-17: возвращает "Подросток"
- 18-64: возвращает "Взрослый"
- 65 и старше: возвращает "Пожилой человек"
- если возраст отрицательный, возвращает "Некорректный возраст"
"""


def categorize_age(age):
    # напиши свой код здесь
    