"""
Цикл while

Напишите функцию collect_numbers, которая запрашивает у пользователя целые числа и сохраняет их в список. 
Функция должна завершить сбор чисел, когда пользователь вводит число 0. После завершения ввода, 
функция должна вернуть кортеж с элементами, расположенными в следующем порядке:
1. Список введенных чисел.
2. Сумму всех введенных чисел.
3. Среднее значение введенных чисел (исключая 0).
4. Максимальное и минимальное введенное число (исключая 0).
5. Количество введенных четных и нечетных чисел.
6. Количество введенных положительных и отрицательных чисел.

"""


def collect_numbers():
    # напиши свой код
    